app/controllers/board_controller.rb

  def show
    if BoardPost.exists?(params[:id]) then @msg=BoardPost.find(params[:id]).body
    else @msg="not found"
      flash[:err]="no such entry. First entry id is #{BoardPost.first.id}"
---
SELECT `board_posts`.id FROM `board_posts` WHERE (`board_posts`.`id` = '23423') LIMIT 1
SELECT * FROM `board_posts` LIMIT 1